app/models/project.rb

SELECT "documents".* FROM "documents" WHERE "documents"."project_name" = $1  [["project_name", "MOVE"]]
---

    if project != nil
     @documents = Hash.new
     Document.where(project_name: project.upcase).each do |d|