app/views/list.erb

<% @pHash = Hash.new %>
<% Document.select('*').group('id,project_name').find_each{|d| @pHash.store(d.read_attribute(:project_name),d.read_attribute(:pm_standard))} %>
---
SELECT * FROM "documents" GROUP BY id,project_name ORDER BY "documents"."id" ASC LIMIT $1  [["LIMIT", 1000]]