app/views/list.erb

    <ul>
      <% Document.all.each do |d| %>
---
SELECT "documents".* FROM "documents"

   <ul>
     <% Document.where(project_name: @params['project_name'].upcase!).find_each do |d| %>
---
SELECT "documents".* FROM "documents" WHERE "documents"."project_name" = $1 ORDER BY "documents"."id" ASC LIMIT $2  [["project_name", "show"], ["LIMIT", 1000]]